<template>
  <main class="about container">
    <h1 class="h3 about__title">О нас</h1>
    <div class="about__description p_hg">
      Компания «Tuotown» – завод-производитель, который специализируется на изготовлении
      профессиональных кухонных ножей, кухонных принадлежностей, точильных систем для заточки ножей
      и инструментов, посуды и инструментов для дома и дачи, аксессуаров из пищевого силикона,
      нейлона и нержавеющей стали для кухни. <br />
      <br />
      Автоматизированные линии производства с применением передового европейского оборудования ,
      современные материалы позволяют делать продукцию высокого качества и в больших объёмах.
      Благодаря этим факторам продукция TUOTOWN получила признание во всех странах СНГ.
      <br />
      <br />
      Производственное предприятие TUOTOWN основано в 1992 году, находится в г. Яньцзян, провинция
      Гуандун, Китай. Компания «Tuotown» чтит традиции многовековых технологий , а также традиции
      кованных изделий в современном стиле , благодаря которым становится более доступной за счет
      автоматизации для потребителя. Ножи «Tuotown» отличаются идеальным балансом и непревзойденной
      остротой. Ассортимент компании насчитывает более 1000 изделий. В том числе TUOTOWN предлагает
      широкий ассортимент сопутствующих товаров, товаров для туризма, барбекю и гриля, а также
      складных ножей.
    </div>
  </main>
</template>

<script setup lang="ts"></script>

<style scoped lang="scss">
.about {
  padding-top: 65px;

  @media (min-width: 768px) {
    padding-top: 85px;
  }

  &__title {
    color: $white;
    text-align: center;

    margin-bottom: 30px;
  }

  &__description {
    color: $white;
    line-height: 140%;
  }
}
</style>
